Tekla Open API Reference for Tekla Structures 2025
Vector.Normalize Method (Double)
 Normalizes the vector using the given length.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Normalize(
	double NewLength
)
Public Function Normalize (
	NewLength As Double
) As Double
Parameters
NewLength
Type: System.Double
The length to be used.
Return Value
Type: Double
The normalized vector's length.
See Also
Reference
Vector Class
Normalize Overload
Tekla.Structures.Geometry3d Namespace